Конфигурация/Documents/ПогашениеКупона.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПогашениеКупона</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумагПроданныеВРепо</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ОперацииСЦеннымиБумагами</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумаг</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумагКупленныеПоРЕПО</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Облигация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФиксации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличествоЦелое</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНаОднуОблигацию</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНаОднуОблигациюВВалютеОплаты</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКупонаВВалютеОплаты</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/КупонныйДоходПоОблигациям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КупонныйДоходПоОблигациям</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтавкаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаПроцент</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияКупона</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПубликации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаФиксации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупонаВВалютеОплаты</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыплатыПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыплатыФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКупона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаРасчетаСтавки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаОпределена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Облигация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/РынкиЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>РынкиЦенныхБумаг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Акции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Облигации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Паи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Векселя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закладные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИпотечныеСертификатыУчастия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитарныеРасписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фьючерсы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опционы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВалютныеПары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доли</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДрагоценныеМеталлы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/ПогашениеКупона/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ
/////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	ЗаполнитьПодтверждениеОперацииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении();
	
	Оповестить("СводноеПогашениеКупона.Обновить", Объект.Ссылка);
	
	РаботаСДокументамиКлиент.ПроверитьПараметрыПодтвержденияОперации(ЭтаФорма, Объект, ПараметрыЗаписи);

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтаФорма.ОплатаЧерезБрокера = 1 Тогда
		ПроверяемыеРеквизиты.Добавить("Брокер");
	КонецЕсли;
	
	Если ЭтаФорма.ДетализацияПоРасчетномуСчету Тогда
		ПроверяемыеРеквизиты.Добавить("РасчетныйСчет");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ПодтверждениеОперации" Тогда
		Если Параметр = Объект.Ссылка
			ИЛИ (ТипЗнч(Параметр) = Тип("Массив") И Параметр.Найти(Объект.Ссылка) <> Неопределено)
		Тогда
			ЗаполнитьПодтверждениеОперацииНаСервере();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////
#КонецОбласти

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ЭЛЕМЕНТОВ_ШАПКИ_ФОРМЫ
/////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
	РаботаСДокументамиКлиент.ДетализацияПоРасчетномуСчетуПриИзмененииСвязанныхРеквизитов(ЭтаФорма);
	
	Если Не РаботаСИсполнителями.ЕстьИсполнитель(?(ЭтаФорма.ОплатаЧерезБрокера = 1, "ИсполнителиПоДенежнымСредствамБрокерские", "ИсполнителиПоДенежнымСредствамСобственные"),
		ОбщегоНазначенияКлиентСервер.ПоляВСтруктуру(Объект, "Дата, Организация, СчетДоверительногоУправления, Брокер, РасчетныйСчет"))
	Тогда
		Объект.РасчетныйСчет = Неопределено;
	КонецЕсли;
	
	ОбновитьСуммыНаОднуОблигацию();
	
	ПересчетСуммы();
	
КонецПроцедуры

&НаКлиенте
Процедура БрокерПриИзменении(Элемент)
	
	РаботаСДокументамиКлиент.ДетализацияПоРасчетномуСчетуПриИзмененииСвязанныхРеквизитов(ЭтаФорма);
	
КонецПроцедуры 

&НаКлиенте
Процедура ОплатаЧерезБрокераПриИзменении(Элемент)
	
	Если ЭтаФорма.ОплатаЧерезБрокера = 0 Тогда
		Объект.Брокер = Неопределено;
	КонецЕсли;
	
	Элементы.Брокер.Видимость = (ЭтаФорма.ОплатаЧерезБрокера = 1); 
	
	БрокерПриИзменении(ЭтаФорма.ОплатаЧерезБрокера);
	
КонецПроцедуры

&НаКлиенте
Процедура ОблигацияПриИзменении(Элемент)
	
	ЭтаФорма.ВалютаНоминала = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Облигация, "ВалютаНоминала");
	
	Если НЕ ЗначениеЗаполнено(Объект.ВалютаОплаты) Тогда
		Объект.ВалютаОплаты = ЭтаФорма.ВалютаНоминала;
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	НастроитьВидимостьИЗаголовкиСуммНаСервере();
	
	ЗаполнитьКоличествоРЕПОНаСервере();
	ОбновитьСуммыНаОднуОблигацию();
	ПересчетСуммы();

КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	
	ПересчетСуммы();

КонецПроцедуры

&НаКлиенте
Процедура СуммаНаОднуОблигациюПриИзменении(Элемент)
	
	НоваяСумма = Объект.СуммаНаОднуОблигацию * Объект.Количество;
	
	Если НоваяСумма <> 0 Тогда
		// Запрос подтверждения изменения на ненулевое значение
		ТекстВопроса = "Изменить сумму купона на " + Формат(НоваяСумма, "ЧДЦ=2") + "?";
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		Иначе
			Объект.СуммаКупона = НоваяСумма;
		КонецЕсли;
	Иначе
		// При вводе 0 — заполняем автоматически
		Объект.СуммаКупона = НоваяСумма;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаНаОднуОблигациюВВалютеОплатыПриИзменении(Элемент)
	
	НоваяСумма = Объект.СуммаНаОднуОблигациюВВалютеОплаты * Объект.Количество;
	
	Если НоваяСумма <> 0 Тогда
		// Запрос подтверждения изменения на ненулевое значение
		ТекстВопроса = "Изменить сумму купона на " + Формат(НоваяСумма, "ЧДЦ=2") + "?";
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		Иначе
			Объект.СуммаКупонаВВалютеОплаты = НоваяСумма;
		КонецЕсли;
	Иначе
		// При вводе 0 — заполняем автоматически
		Объект.СуммаКупонаВВалютеОплаты = НоваяСумма;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаФиксацииПриИзменении(Элемент)
	
	ЗаполнитьКоличествоРЕПОНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	ЗаполнитьКоличествоРЕПОНаСервере();	
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетныйСчетПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.РасчетныйСчет) Тогда
		
		ВалютаРасчетногоСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РасчетныйСчет, "Валюта");
		
		Если Объект.ВалютаОплаты <> ВалютаРасчетногоСчета Тогда
			ОбновитьСуммыНаОднуОблигацию();
			ПересчетСуммы(ВалютаРасчетногоСчета);
			Объект.ВалютаОплаты = ВалютаРасчетногоСчета;
		КонецЕсли;
		
		НастроитьВидимостьИЗаголовкиСуммНаСервере();
		
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ВалютаОплатыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.СверитьВыбранноеЗначениеВалютыСВалютойРасчетногоСчета(ВыбранноеЗначение, Объект.ВалютаОплаты, Объект.РасчетныйСчет);
	
	Если ВыбранноеЗначение <> Объект.ВалютаОплаты Тогда
		ОбновитьСуммыНаОднуОблигацию();
		ПересчетСуммы(ВыбранноеЗначение);
		Объект.ВалютаОплаты = ВыбранноеЗначение;
		НастроитьВидимостьИЗаголовкиСуммНаСервере();
	КонецЕсли;
	
КонецПроцедуры
/////////////////////////////////////////////////////////////////////////////////
#КонецОбласти

#Область ОБРАБОТЧИКИ_КОМАНД
/////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура КомандаВыбратьИсполнителяПоДенежнымСредствам(Команда)
	
	РаботаСДокументамиКлиент.ВыбратьИсполнителяПоДенежнымСредствам(ЭтаФорма, ЭтаФорма.ОплатаЧерезБрокера);
	РасчетныйСчетПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрытьГрафикНачисленияПроцентов(Команда)
	
	ОткрытьФорму("РегистрСведений.КупонныйДоходПоОблигациям.ФормаСписка", Новый Структура("Отбор",Новый Структура("Облигация", Объект.Облигация)), ЭтаФорма); 
	   
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаРасчета(Команда)
	
	СписокПартий = ПолучитьСписокПартий(Объект.Ссылка, Объект.СчетДоверительногоУправления, Объект.Организация, Объект.Облигация);
	
	Если СписокПартий.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет движений по регистру ""Партии ценных бумаг""");
		Возврат;
	КонецЕсли;
	
	ЭлементСпискаПартий =  СписокПартий.ВыбратьЭлемент("Партия");
	
	Если ЭлементСпискаПартий <> Неопределено Тогда
		ПараметрыФормы = Новый Структура("ДатаПереоценки, Организация, СчетДоверительногоУправления, 
			|Количество, ОценочнаяСуммаКупона, ЦеннаяБумага, Партия, СтрокаПартии, УчетныйАктивЕПС, БалансовыйДисконт, Стоимость", 
			Объект.Дата, 
			Объект.Организация, 
			Объект.СчетДоверительногоУправления, 
			ЭлементСпискаПартий.Значение.Количество, 
			0, // - при погашении купона он уже 0!
			Объект.Облигация, 
			ЭлементСпискаПартий.Значение.Партия, 
			ЭлементСпискаПартий.Значение.СтрокаПартии,
			ЭлементСпискаПартий.Значение.УчетныйАктивЕПС,
			ЭлементСпискаПартий.Значение.БалансовыйДисконт,
			ЭлементСпискаПартий.Значение.Стоимость);
		ОткрытьФорму("Отчет.РасшифровкаРасчетаАмортизацииДисконтаПремииИКорректировкиПоЭСП.Форма.Форма", ПараметрыФормы, ЭтаФорма, ЭтаФорма,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокПартий(ПогашениеКупона, СчетДоверительногоУправления, Организация, Облигация)
	
	СписокПартий = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумаг.Партия КАК Партия,
		|	БухПартииЦенныхБумаг.СтрокаПартии КАК СтрокаПартии,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	СУММА(БухПартииЦенныхБумагОстатки.КоличествоОстаток) КАК Количество,
		|	СУММА(БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйОстаток) КАК ДисконтПремияНачисленный,
		|	СУММА(БухПартииЦенныхБумагОстатки.СтоимостьОстаток) КАК Стоимость
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|				&Период,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ЦеннаяБумага = &ЦеннаяБумага
		|					И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК БухПартииЦенныхБумагОстатки
		|		ПО БухПартииЦенныхБумаг.Партия = БухПартииЦенныхБумагОстатки.Партия
		|			И БухПартииЦенныхБумаг.СтрокаПартии = БухПартииЦенныхБумагОстатки.СтрокаПартии
		|			И БухПартииЦенныхБумаг.УчетныйАктивЕПС = БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС
		|ГДЕ
		|	БухПартииЦенныхБумаг.Регистратор = &Регистратор
		|	И БухПартииЦенныхБумаг.ЦеннаяБумага = &ЦеннаяБумага
		|	И БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И БухПартииЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|
		|СГРУППИРОВАТЬ ПО
		|	БухПартииЦенныхБумаг.СтрокаПартии,
		|	БухПартииЦенныхБумаг.ВидДвижения,
		|	БухПартииЦенныхБумаг.Партия,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС";

	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ЦеннаяБумага", Облигация);
	Запрос.УстановитьПараметр("Регистратор", ПогашениеКупона);
	Запрос.УстановитьПараметр("Период", Новый Граница(ПогашениеКупона.МоментВремени(), ВидГраницы.Исключая));

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокПартий.Добавить(
			Новый Структура("Партия, СтрокаПартии, УчетныйАктивЕПС, Количество, БалансовыйДисконт, Стоимость",
				Выборка.Партия, Выборка.СтрокаПартии, Выборка.УчетныйАктивЕПС, Выборка.Количество, Выборка.ДисконтПремияНачисленный, Выборка.Стоимость),
			Строка(Выборка.Партия) + ". Строка партии:" +  Выборка.СтрокаПартии);
	КонецЦикла;
	
	Возврат СписокПартий;
	
КонецФункции


/////////////////////////////////////////////////////////////////////////////////
#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ
/////////////////////////////////////////////////////////////////////////////////

&НаКлиенте 
Процедура ПересчетСуммы(НоваяВалютаОплаты = Неопределено)
	
	Если НоваяВалютаОплаты = Объект.ВалютаОплаты Тогда
		Возврат;
	КонецЕсли;
	
	Объект.СуммаКупона = Объект.Количество * Объект.СуммаНаОднуОблигацию;
	Объект.СуммаКупонаВВалютеОплаты = Объект.Количество * Объект.СуммаНаОднуОблигациюВВалютеОплаты;

КонецПроцедуры	

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ЭтаФорма.ДетализацияПоРасчетномуСчету	= РаботаСДокументами.ТребуетсяДетализацияПоРасчетномуСчету(Объект);
	ЭтаФорма.ОплатаЧерезБрокера  		 	= ?(ЗначениеЗаполнено(Объект.Брокер), 1, 0);

	ЗаполнитьКоличествоРЕПОНаСервере();
	
	ЭтаФорма.ВалютаНоминала = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Облигация, "ВалютаНоминала");
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	НастроитьВидимостьИЗаголовкиСуммНаСервере();
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСуммыНаОднуОблигацию()
	
	Если Не ЗначениеЗаполнено(Объект.Облигация) Или Не ЗначениеЗаполнено(Объект.Дата) Тогда
		Объект.СуммаНаОднуОблигацию = 0;
		Объект.СуммаНаОднуОблигациюВВалютеОплаты = 0;
		Возврат;
	КонецЕсли;
	
	СуммыИзРегистра = ПолучитьСуммыКупона(Объект.Облигация, Объект.Дата);
	
	Объект.СуммаНаОднуОблигацию = СуммыИзРегистра.СуммаКупона;
	Объект.СуммаНаОднуОблигациюВВалютеОплаты = СуммыИзРегистра.СуммаКупонаВВалютеОплаты; 
	
	Если Объект.СуммаНаОднуОблигацию = 0 И Объект.СуммаНаОднуОблигациюВВалютеОплаты = 0 Тогда
		Сообщить(
			"В регистре ""Купонный доход по облигациям"" не найдены суммы купона для облигации " 
			+ Строка(Объект.Облигация) + " на дату " + Формат(Объект.Дата, "ДФ=dd.MM.yyyy"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСуммыКупона(Облигация, Дата) Экспорт
	
	Результат = Новый Структура("СуммаКупона,СуммаКупонаВВалютеОплаты", 0, 0);
	
	Если Не ЗначениеЗаполнено(Облигация) Или Не ЗначениеЗаполнено(Дата) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КупонныйДоходПоОблигациям.СуммаКупона КАК СуммаКупона,
		|	КупонныйДоходПоОблигациям.СуммаКупонаВВалютеОплаты КАК СуммаКупонаВВалютеОплаты
		|ИЗ
		|	РегистрСведений.КупонныйДоходПоОблигациям КАК КупонныйДоходПоОблигациям
		|ГДЕ
		|	КупонныйДоходПоОблигациям.Облигация = &Облигация
		|	И КупонныйДоходПоОблигациям.ДатаОкончанияКупона = &Дата";
	
	Запрос.УстановитьПараметр("Облигация", Облигация);
	Запрос.УстановитьПараметр("Дата",      НачалоДня(Дата));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат.СуммаКупона = Выборка.СуммаКупона;
		Результат.СуммаКупонаВВалютеОплаты = Выборка.СуммаКупонаВВалютеОплаты;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма)
	
	Элементы = Форма.Элементы;

	Элементы.Брокер.Видимость = (Форма.ОплатаЧерезБрокера = 1);
	
	// элементы, зависящие от детализации по р/с
	РаботаСДокументамиКлиентСервер.НастроитьВидимостьИДоступностьРасчетногоСчетаИСвязанныхРеквизитов(Форма);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьИЗаголовкиСуммНаСервере()
	
	ЭтаФорма.ВалютаНоминала = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Облигация, "ВалютаНоминала");
	ПрефиксВалютыНоминала 	= " в " + Строка(ВалютаНоминала);
	ПрефиксВалютыОплаты 	= " в " + Строка(Объект.ВалютаОплаты);
	
	Элементы.СуммаНаОднуОблигацию.Заголовок				 = "Сумма на одну облигацию" + ПрефиксВалютыНоминала;
	Элементы.СуммаКупона.Заголовок						 = "Сумма купона" + ПрефиксВалютыНоминала;
	Элементы.СуммаНаОднуОблигациюВВалютеОплаты.Заголовок = "Сумма на одну облигацию" + ПрефиксВалютыОплаты;
	Элементы.СуммаКупонаВВалютеОплаты.Заголовок          = "Сумма купона" + ПрефиксВалютыОплаты;
	Элементы.СуммаНаОднуОблигациюВВалютеОплаты.Видимость = (ЭтаФорма.ВалютаНоминала <> Объект.ВалютаОплаты);
	Элементы.СуммаКупонаВВалютеОплаты.Видимость          = (ЭтаФорма.ВалютаНоминала <> Объект.ВалютаОплаты);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКоличествоРЕПОНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоЦеннымБумагамОстатки.Основание,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ВидЗадолженности,
		|	ЗадолженностиПоЦеннымБумагамОстатки.ТипЗадолженности,
		|	ЗадолженностиПоЦеннымБумагамОстатки.КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_ЗадолженностиПоЦеннымБумагамОстатки
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоЦеннымБумагам.Остатки(
		|			&ДатаФиксации,
		|			(ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО)
		|				ИЛИ ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО))
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Рынок = &Рынок
		|				И ЦеннаяБумага = &ЦеннаяБумага) КАК ЗадолженностиПоЦеннымБумагамОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ВложенныйЗапрос.КоличествоВРЕПО) КАК КоличествоВРЕПО,
		|	СУММА(ВложенныйЗапрос.КоличествоПоРЕПО) КАК КоличествоПоРЕПО
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВЫБОР
		|			КОГДА ВТ_ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|				ТОГДА ВТ_ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.КоличествоОстаток - ЕСТЬNULL(ВТ_ЗадолженностиПоЦеннымБумагамПоПервойЧастиРЕПО.КоличествоОстаток, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК КоличествоВРЕПО,
		|		ВЫБОР
		|			КОГДА ВТ_ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|				ТОГДА ВТ_ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.КоличествоОстаток - ЕСТЬNULL(ВТ_ЗадолженностиПоЦеннымБумагамПоПервойЧастиРЕПО.КоличествоОстаток, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК КоличествоПоРЕПО
		|	ИЗ
		|		ВТ_ЗадолженностиПоЦеннымБумагамОстатки КАК ВТ_ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗадолженностиПоЦеннымБумагамОстатки КАК ВТ_ЗадолженностиПоЦеннымБумагамПоПервойЧастиРЕПО
		|			ПО ВТ_ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.Основание = ВТ_ЗадолженностиПоЦеннымБумагамПоПервойЧастиРЕПО.Основание
		|				И (ВТ_ЗадолженностиПоЦеннымБумагамПоПервойЧастиРЕПО.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПервойЧастиРЕПО))
		|	ГДЕ
		|		ВТ_ЗадолженностиПоЦеннымБумагамПоВторойЧастиРЕПО.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВЫБОР
		|			КОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|				ТОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.КоличествоОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|				ТОГДА ЗадолженностиПоВторойЧастиРЕПООстатки.КоличествоОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.ЗадолженностиПоВторойЧастиРЕПО.Остатки(
		|				&ДатаФиксации,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И Рынок = &Рынок
		|					И ЦеннаяБумага = &ЦеннаяБумага) КАК ЗадолженностиПоВторойЧастиРЕПООстатки) КАК ВложенныйЗапрос";
		
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Организация"					, Объект.Организация);
	Запрос.УстановитьПараметр("Рынок"						, Перечисления.РынкиЦенныхБумаг.Облигации);
	Запрос.УстановитьПараметр("ЦеннаяБумага"				, Объект.Облигация);
	Запрос.УстановитьПараметр("ДатаФиксации"				, ?(Объект.ДатаФиксации = НачалоДня(Объект.Дата), НачалоДня(Объект.ДатаФиксации), КонецДня(Объект.ДатаФиксации)));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЭтаФорма.ИнформацияКоличествоРЕПО = ?(ЗначениеЗаполнено(Выборка.КоличествоВРЕПО), "Продано в РЕПО: " + Строка(Выборка.КоличествоВРЕПО), "")
				+ ?(ЗначениеЗаполнено(Выборка.КоличествоПоРЕПО), ?(ЗначениеЗаполнено(Выборка.КоличествоВРЕПО), ", куплено по РЕПО: ", " из них куплено по РЕПО: ") + Строка(Выборка.КоличествоПоРЕПО), "");
	Иначе
		ЭтаФорма.ИнформацияКоличествоРЕПО = "";
	КонецЕсли;
	
	Элементы.ИнформацияКоличествоРЕПО.Видимость = Не ПустаяСтрока(ЭтаФорма.ИнформацияКоличествоРЕПО);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиПоБухгалтерскомуУчету()

	РаботаСФормамиКлиент.ПровестиПоБухгалтерскомуУчету(ЭтаФорма); 

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодтверждениеОперацииНаСервере()

	РаботаСДокументами.ЗаполнитьПодтверждениеОперации(ЭтаФорма, Объект.Ссылка);		

КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.СчетДоверительногоУправленияОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.ДатаОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////
#КонецОбласти
